# SolidCurveIntersectionOptions Properties

---
The SolidCurveIntersectionOptions type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
| ResultType|  The type of results expected by the calculation. The default is CurveSegmentsInside.
Top
#### Reference
SolidCurveIntersectionOptions Class
Autodesk.Revit.DB Namespace